
## Plan Result (stg)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 6 to change, 2 to destroy.</code></pre>

* Update
  * module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies[&#34;elinks-health&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies[&#34;get-people&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies[&#34;get-people-by-params&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies[&#34;publication-health&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies[&#34;update-people&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies[&#34;update-publication&#34;]
* Replace
  * azurerm_role_assignment.app_insight_viewers[0]
  * azurerm_role_assignment.app_insight_viewers_monitoring[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.app_insight_viewers[0] must be replaced
-/+ resource "azurerm_role_assignment" "app_insight_viewers" {
      ~ id                                     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/loggers/sds-api-mgmt-stg-logger/providers/Microsoft.Authorization/roleAssignments/f2e4a424-af9e-d64a-274a-20e93ccc32be" -> (known after apply)
      ~ name                                   = "f2e4a424-af9e-d64a-274a-20e93ccc32be" -> (known after apply)
      ~ principal_id                           = "6490ec76-a586-4736-a586-e35ca0a24967" -> "/groups/6490ec76-a586-4736-a586-e35ca0a24967" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/providers/Microsoft.Authorization/roleDefinitions/ae349356-3a1b-4a5e-921d-050484c6347e" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.app_insight_viewers_monitoring[0] must be replaced
-/+ resource "azurerm_role_assignment" "app_insight_viewers_monitoring" {
      ~ id                                     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Insights/components/sds-api-mgmt-stg/providers/Microsoft.Authorization/roleAssignments/bbe361e0-f3ee-4a26-cb71-ce533a2b56d3" -> (known after apply)
      ~ name                                   = "bbe361e0-f3ee-4a26-cb71-ce533a2b56d3" -> (known after apply)
      ~ principal_id                           = "6490ec76-a586-4736-a586-e35ca0a24967" -> "/groups/6490ec76-a586-4736-a586-e35ca0a24967" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies["elinks-health"] will be updated in-place
  ~ resource "azurerm_api_management_api_operation_policy" "apim_api_operation_policies" {
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/hmi-apim/operations/elinks-health"
      ~ xml_content         = (sensitive value)
        # (4 unchanged attributes hidden)
    }

  # module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies["get-people"] will be updated in-place
  ~ resource "azurerm_api_management_api_operation_policy" "apim_api_operation_policies" {
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/hmi-apim/operations/get-people"
      ~ xml_content         = (sensitive value)
        # (4 unchanged attributes hidden)
    }

  # module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies["get-people-by-params"] will be updated in-place
  ~ resource "azurerm_api_management_api_operation_policy" "apim_api_operation_policies" {
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/hmi-apim/operations/get-people-by-params"
      ~ xml_content         = (sensitive value)
        # (4 unchanged attributes hidden)
    }

  # module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies["publication-health"] will be updated in-place
  ~ resource "azurerm_api_management_api_operation_policy" "apim_api_operation_policies" {
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/hmi-apim/operations/publication-health"
      ~ xml_content         = (sensitive value)
        # (4 unchanged attributes hidden)
    }

  # module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies["update-people"] will be updated in-place
  ~ resource "azurerm_api_management_api_operation_policy" "apim_api_operation_policies" {
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/hmi-apim/operations/update-people"
      ~ xml_content         = (sensitive value)
        # (4 unchanged attributes hidden)
    }

  # module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies["update-publication"] will be updated in-place
  ~ resource "azurerm_api_management_api_operation_policy" "apim_api_operation_policies" {
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/hmi-apim/operations/update-publication"
      ~ xml_content         = (sensitive value)
        # (4 unchanged attributes hidden)
    }

Plan: 2 to add, 6 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":130,"Program":"tfcmt","SHA1":"","Target":"stg","Vars":{}} -->